## 0. import pandas, seaborn 불러오기

In [3]:
import pandas as pd
import seaborn as sns

In [4]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
df.describe(include= 'object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

## 1. count() : 숫자 세기

In [11]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [13]:
df['age'].count()

np.int64(714)

## 2. mean() : 평균
- df['column'].mean()
    - df.mean(numeric_only=True) : 데이터 프레임 전체를 평균을 내고 싶을때 (숫자만 골라서 내줌)
    - (skipna = False) # skipna : nan인 값을 빼고 계산 가능

In [14]:
df['age'].mean()

#

np.float64(29.69911764705882)

In [21]:
df.mean(numeric_only=True, skipna = False) # skipna : nan인 값을 빼고 계산 가능

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [18]:
### 평균 연습문제 

df.head()

# 1. 성인 남성 요금 평균
cond1 = df['adult_male'] == True
df.loc[cond1, 'fare'].mean()

np.float64(24.864181750465548)

In [20]:
# 2. 30 ~ 40사이의 요금을 지불한 승객 & 1등석인 사람의 나이 평균 구하기
cond1 = df['fare'] >= 30 
cond2 = df['fare'] <= 40

cond3 = df['pclass'] == 1

df.loc[cond1 & cond2 & cond3, 'age'].mean() # => 나이의 평균 44세

np.float64(44.095238095238095)

## 3. median() : 중앙값
-

In [24]:
numbers = [1,2,10,11, 100,1000]
pd.Series(numbers).mean()

np.float64(187.33333333333334)

In [25]:
pd.Series(numbers).median() # => 중위값 : 평균보다 오차범위가 적음

np.float64(10.5)

In [27]:
mean_value = df['age'].mean()
median_value = df['age'].median()
print(mean_value, median_value)

29.69911764705882 28.0

## 4. sum() : 합산
- df.sum(numeric_only=True) : 데이터 프레임 전체를 합산하고 싶을때 (숫자만 골라서 내줌)
- df['fare'].cumsum() : 누적 합
- df['fare'].cumprod() : 누적 곱

In [28]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [29]:
df['fare'].sum()

np.float64(28693.9493)

In [30]:
df['fare'].cumprod()

0      7.250000e+00
1      5.168039e+02
2      4.095671e+03
3      2.174801e+05
4      1.750715e+06
           ...
886    0.000000e+00
887    0.000000e+00
888    0.000000e+00
889    0.000000e+00
890    0.000000e+00
Name: fare, Length: 891, dtype: float64

## 5. var() : 분산
- 데이터가 얼만큼 떨어져 있는지에 대한 정보 : 편차 제곱의 평균

In [34]:
fare_mean = df['fare'].mean()
#fare_mean

# df['fare'] - 1 : 시리즈에서는 합,마이너스 가능

total = ((df['fare'] - fare_mean) ** 2).sum()
total_count = df['fare'].count()


my_var = total / total_count
print(my_var)

2466.665311685043

In [35]:
df['fare'].var()

np.float64(2469.436845743116)

## 6. std() : 표준 편차
- df['fare'].std() = np.sqrt(df['fare'].var()) 동일

In [36]:
import numpy as np
np.sqrt(df['fare'].var())

np.float64(49.6934285971809)

In [37]:
df['fare'].std()

np.float64(49.6934285971809)

## 7. min(), max() : 최댓값, 최솟값
-

In [38]:
df['age'].min()

np.float64(0.42)

In [39]:
df['age'].max()

np.float64(80.0)

## 8. agg() (aggregation)
- df['column'].agg(['min','max'])

In [40]:
df['age'].agg(['max', 'min', 'mean','count'])

max       80.000000
min        0.420000
mean      29.699118
count    714.000000
Name: age, dtype: float64

In [41]:
df[['age','fare']].agg(['min','max'])

       age      fare
min   0.42    0.0000
max  80.00  512.3292

## 9. quantile()
- df['age'].quantile(0.1)

In [42]:
df['age'].quantile(0.1) #하위 10% 찾기

np.float64(14.0)

In [43]:
df['age'].quantile(0.8) #80%

np.float64(41.0)

In [44]:
df['age'].quantile(0.5) #중위값

np.float64(28.0)

In [45]:
df['age'].median()

np.float64(28.0)

## 10. unique()
- df['who'].unique() : 분류 가능한 값의 고유값 확인
- df['who'].nunique() : 분류 가능한 값의 고유값 개수 확인

In [46]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [47]:
df['who'].nunique()

3

## 11. mode()
-

In [5]:
df['who'].mode()

0    man
Name: who, dtype: object

## 12. corr()
- 각 컬럼끼리의 상관관계 -1 ~ 1까지로 표현
    - 정비례 : 1과 가까울수록
    - 반비례 : -1과 가까울수록
  
ex) 생존률과 어덜트 멜은 반비례 : 성인남자의 생존률이 가장 낮음.

In [49]:
df.corr(numeric_only = True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [51]:
df.corr(numeric_only = True)['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64